Bump, running into the same issue trying to import a pre-existing app environment, where the imported environment has a consumption profile, but the Terraform plan has a replace on the environment, with an addition of the Consumption workload profile (redacting some info):
```
  # azurerm_container_app_environment.fake-container-app-environment must be replaced
  # (imported from "/subscriptions/6fa70896-56bf-4b56-8bcd-d6e1588714c2/resourceGroups/fake-resource-group-prod/providers/Microsoft.App/managedEnvironments/fake-app-env-prod")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_container_app_environment" "fake-container-app-environment" {
      ~ custom_domain_verification_id      = "id" -> (known after apply)
      ~ default_domain                     = "cooldomain.eastus.azurecontainerapps.io" -> (known after apply)
      + docker_bridge_cidr                 = (known after apply)
      ~ id                                 = "/subscriptions/6fa70896-56bf-4b56-8bcd-d6e1588714c2/resourceGroups/fake-resource-group-prod/providers/Microsoft.App/managedEnvironments/fake-app-env-prod" -> (known after apply)
        infrastructure_resource_group_name = "fake-generated-name-from-azure"
        infrastructure_subnet_id           = "/subscriptions/6fa70896-56bf-4b56-8bcd-d6e1588714c2/resourceGroups/fake-resource-group-prod/providers/Microsoft.Network/virtualNetworks/fake-vnet/subnets/private-1"
        internal_load_balancer_enabled     = false
        location                           = "eastus"
      ~ log_analytics_workspace_id         = "/subscriptions/6fa70896-56bf-4b56-8bcd-d6e1588714c2/resourceGroups/fake-resource-group-prod/providers/Microsoft.OperationalInsights/workspaces/fakeappenvprod" -> (known after apply)
        logs_destination                   = "log-analytics"
        mutual_tls_enabled                 = false
        name                               = "fake-app-env-prod"
      + platform_reserved_cidr             = (known after apply)
      + platform_reserved_dns_ip_address   = (known after apply)
        resource_group_name                = "fake-resource-group-prod"
      ~ static_ip_address                  = "cool-ip-address" -> (known after apply)
      ~ tags                               = {
          + "Environment" = "prod"
        }
        zone_redundancy_enabled            = true

      + workload_profile { # forces replacement
          + name                  = "Consumption"
          + workload_profile_type = "Consumption"
        }
    }
```